# Напишите программу, которая находит среднее арифметическое двух чисел: заведите две переменные и запишите в каждую из них по числу.
# Потом заведите третью и запишите в неё среднее арифметическое первых двух.
# А потом выведите всё это на экран

greeting = [

	"Введите два числа:",
	"Здравствуйте, введите пожалуйста два целых натуральных числа:",
	"Оу.. Вы нас снова посетили! Не соблаговолите ли ввести два числа для нахождения их среднего арифметического? Прошу:"

]

puts greeting.sample

num1 = gets.to_i
num2 = gets.to_i

num3 = (num1 + num2)/2

puts "Среднее арифметическое чисел #{num1} и #{num2} => #{num3}"